In [1]:
from functions import *

# Student VLE
---

The Student VLE Dataframe contains information about student interactions with the online resources in the Virtual Learning Environment

In [2]:
student_vle.head()

  code_module code_presentation  id_student  id_site  date  sum_click
0         AAA             2013J       28400   546652   -10          4
1         AAA             2013J       28400   546652   -10          1
2         AAA             2013J       28400   546652   -10          1
3         AAA             2013J       28400   546614   -10         11
4         AAA             2013J       28400   546714   -10          1

---

## Student VLE Contents

* **code_module**: The code module is the module the resource and student are associated with.
* **code_presentation**: The code presentation represents the time the module was held at.
* **id_site**: The site ID is the unique identifier for the online resource with which the student engaged.
* **date**: The date represents the date that the student engaged with the material relevant to the start date of the module.
* **sum_click**: The sum click represents the number of clicks the student made on that day.

---

## Student VLE Information

**Size**

In [3]:
get_size(student_vle)

            Count
Columns         6
Rows     10655280

In [4]:
# store the size of student_vle's columns
stud_vle_cols = len(student_vle.columns)
# store the size of student_vle's rows
stud_vle_rows = len(student_vle)
md(f'''
Student VLE has {stud_vle_cols} columns and {"{:,}".format(stud_vle_rows)} rows which represent the student resource interactions we have data for.
''')

Student VLE has 6 columns and 10,655,280 rows which represent the student resource interactions we have data for.

**Data Types**

In [5]:
get_dtypes(student_vle)

In [6]:
student_vle = student_vle.astype({'id_site':str, 'id_student':str})
student_vle = student_vle.convert_dtypes(convert_integer=False)

**Null Values**

In [7]:
null_vals(student_vle)

**Duplicate Values**

In [8]:
duplicates = get_dupes(student_vle)
duplicates.head()

    code_module code_presentation id_student id_site  date  sum_click
2           AAA             2013J      28400  546652   -10          1
63          AAA             2013J      45462  546652   -10          1
180         AAA             2013J      77367  546652   -10          4
193         AAA             2013J      94961  546652   -10          2
442         AAA             2013J     248270  546652   -10          4

In [13]:
md(f'''
There are {"{:,}".format(len(duplicates))} duplicated rows which are merely the same students on the same day, interacting with the same material in the same way, which is to be expected.
''')

There are 787,170 duplicated rows which are merely the same students on the same day, interacting with the same material in the same way, which is to be expected.

**Unique Value Counts**

In [10]:
count_unique(student_vle)

In [15]:
unique_students = student_vle['id_student'].nunique()
si_unique_students = student_info['id_student'].nunique()
md(f'''
There are {"{:,}".format(unique_students)} in the student_vle out of the {"{:,}".format(si_unique_students)} 
students we have in student info. So {"{:,}".format(si_unique_students - unique_students)} students from student info do not have online interaction data.
''')

There are 26,074 in the student_vle out of the 28,785
students we have in student info. So 2,711 students from student info do not have online interaction data.

**Numerical Values**

In [11]:
student_vle.describe().round(1)

             date   sum_click
count  10655280.0  10655280.0
mean         95.2         3.7
std          76.1         8.8
min         -25.0         1.0
25%          25.0         1.0
50%          86.0         2.0
75%         156.0         3.0
max         269.0      6977.0